{
  "contact_info": {
    "first_name": "Snehashish Reddy",
    "last_name": "Manda",
    "phone": "+1-919-672-2226",
    "email": "srmanda.cs@gmail.com",
    "location": "Raleigh, NC",
    "linkedin_url": "https://www.linkedin.com/in/srmanda-cs/",
    "github_url": "https://github.com/srmanda-cs",
    "portfolio_url": "https://srmanda.com/",
    "kaggle_url": "https://www.kaggle.com/ashishreddy9000"
  },
  "professional_summaries": "Graduate-level Software Engineer with experience delivering enterprise-grade solutions in two hands-on internships. Authorized to work full-time in U.S. without requiring any sponsorship now or for foreseeable future. Availability begins with CPT in January 2026, then F-1 OPT/STEM from June 2026 to 2029.",
  "education": [
    {
      "institution": "UNC Chapel Hill",
      "degree": "Master of Science in Computer Science",
      "graduation_date": "2026-05",
      "gpa": "",
      "relevant_coursework": [],
      "honors": []
    },
    {
      "institution": "Amrita University",
      "degree": "Bachelor of Technology in Computer Science",
      "graduation_date": "2024-06",
      "gpa": "",
      "relevant_coursework": [],
      "honors": []
    }
  ],
  "skills": {
    "programming_languages": [
      "Python",
      "TypeScript",
      "JavaScript",
      "Java",
      "SQL",
      "Dart"
    ],
    "frameworks_and_libraries": [
      "Next.js",
      "React",
      "Flask",
      "FastAPI",
      "Spring Boot",
      "Fluent UI",
      "Pandas",
      "NumPy",
      "Tensorflow",
      "Keras",
      "scikit-learn",
      "Sentence Transformers",
      "PuLP",
      "OR-Tools"
    ],
    "databases": ["PostgreSQL", "MySQL", "AWS OpenSearch", "Firebase"],
    "cloud_and_devops": [
      "AWS (S3, Lambda, EC2)",
      "Azure",
      "Docker",
      "Kubernetes",
      "Git",
      "GitHub Actions",
      "CI/CD"
    ],
    "ai_and_ml": [
      "LLMs",
      "RAG (Retrieval-Augmented Generation)",
      "NLP",
      "Tesseract OCR",
      "UMAP",
      "Computer Vision"
    ],
    "tools_and_project_management": [
      "JIRA",
      "Trello",
      "Agile Methodologies",
      "PollEverywhere API",
      "Postman"
    ]
  },
  "work_experience": [
    {
      "job_title": "Instructional Assistant (Course Infrastructure)",
      "company": "Neuroscience @ UNC-CH",
      "start_date": "2025-08",
      "end_date": "Present",
      "bullet_points": [
        "Designed a PollEv auto grading platform that used to take per instructor 3 hours a week.",
        "Now, this system is being used by 12+ instructors, and there are talks to integrate this platform university wide",
        "Tightened up a lot of the NSCI 175 course infrastructure, modernizing it introducing Trello and Jira to the team.",
        "Helping run the course like a software team which has made us a lot more efficient.",
        "I have to co-ordinate with the professor (my manager), three other GTAs (my colleagues), and five ULAs (my juniors)",
        "We are supposed to work 10 hours a week, but my systems help us cut down the work to just 5 hours a week.",
        "Initially they were reluctant to use these tools as they thought it would just be extra work, so I had to prove the value of them first.",
        "Learnt an unknown field, that is neuroscience, and gave a lecture to 200 students on a topic they knew better than me, and still was commended.",
        "Shows just how fast I can learn and pick up skills.",
        "The department leadership noticed my contributions, which were way above the scope of a GTA.",
        "Upon request for additional scholarship, they awarded me $5,000 which their policies usually do not allow for my exceptional technical contributions"
      ],
      "keywords": [
        "Python",
        "NLP",
        "LLMs",
        "Sentence Transformers",
        "JIRA",
        "Trello",
        "PollEverywhere API",
        "Project Management Software",
        "System Design",
        "Process Automation",
        "Agile Methodologies",
        "Process Improvement",
        "Workflow Optimization",
        "Educational Technology",
        "Prompt Engineering",
        "Team Coordination",
        "Mentorship",
        "Team Leadership",
        "Change Management",
        "Persuasion",
        "Rapid Learning",
        "Public Speaking",
        "Stakeholder Engagement",
        "Negotiation",
        "Initiative"
      ]
    },
    {
      "job_title": "Software Development Engineer",
      "company": "Tally",
      "start_date": "2024-01",
      "end_date": "2024-05",
      "bullet_points": [
        "Developed a Proof-of-Concept for a new Performance Management System using React, Fluent UI, and Flask",
        "Their PMS was 40 years old, and employees were very unsatisfied.",
        "No sane person was gonna tackle this task, so it was handed over to us.",
        "We were an intern team of my manager, and 3 other interns.",
        "We were trained in React, and I proved my worth very quickly.",
        "I was put in charge of the PoC development now, and my manager would provide me high level guidance.",
        "We put forward a PoC, which the management really liked.",
        "Eventually, they approved a $1M+ investment into the new PMS.",
        "The project was handed off to a highly senior team as it was now too high profile for me.",
        "Seeing my success, I was quickly put in charge of another production project.",
        "The company was having a headache with Azure Graph, assets, inventory, devices and onPrems.",
        "Old devices still had access to top secret information, and they couldn't track which device was where or why. It was a big mess.",
        "I developed a Next.js portal (in TypeScript), using MySQL, Docker, Kubernetes, Git, and Azure.",
        "I was given full ownership of the project and integrating it into their HR admin portal.",
        "Through my manager, I got access to a DevOps person, a tester, a database person, and we were now a team.",
        "Aggregating information from multiple databases, using algorithms to determine what all devices were currently active.",
        "Integrated it into the HR flow, as now when a person is fired or leaves, their devices automatically are removed.",
        "Then, notifications are sent to both parties to collect the devices back.",
        "Since deploying this system, they have not reported a single lost device or internal breach because of old devices.",
        "The position that was responsible for doing this job was now made redundant, and in general a lot of time was saved for everyone.",
        "The internship was supposed to be for 6 months, but they said go finish your degree properly, ended it in 5 months.",
        "They offered a PPO, with competitive salary, and asked me to immediately return after graduation.",
        "Aided in enabling a $1M+ investment for an enterprise-wide Performance Management System by developing and delivering a key proof-of-concept in ReactJS, and Fluent UI.",
        "Minimized asset-tracking costs by 37% by building a full-stack Next.js portal that integrated with Azure AD, Graph API, and internal inventory systems for 10,000+ employees.",
        "Shrank manual deployment effort by 25% by enhancing the team’s CI/CD pipeline with automated build triggers and deployment scripts, improving release stability for critical internal services."
      ],
      "keywords": [
        "React",
        "Next.js",
        "TypeScript",
        "Flask",
        "Python",
        "MySQL",
        "Docker",
        "Kubernetes",
        "Git",
        "Azure",
        "Azure Graph API",
        "Fluent UI",
        "Full-Stack Development",
        "System Architecture",
        "Proof-of-Concept (PoC) Development",
        "System Modernization",
        "Security Enhancement",
        "Process Automation",
        "Algorithm Design",
        "API Integration",
        "Database Management",
        "DevOps",
        "Project Ownership",
        "Leadership",
        "Rapid Learning",
        "Initiative",
        "Problem Solving",
        "Business Acumen",
        "Stakeholder Presentation",
        "Team Coordination",
        "Impact Delivery",
        "Trust and Reliability"
      ]
    },
    {
      "job_title": "Software Development Engineer",
      "company": "Vivriti Capital",
      "start_date": "2024-07",
      "end_date": "2024-08",
      "bullet_points": [
        "They didn't have a project for us on arrival, so we were very surprised.",
        "We were a team of 5 interns with one manager. 4 as SDEs, and 1 as MLE.",
        "We had a meeting where we were trying to decide what project to take on.",
        "I got bored and asked them what problems were the higher ups bringing up to the software team.",
        "Manager among a few other things, mentioned that they were bleeding time and resources processing Credit Information Reports.",
        "This report was very critical for them, the company gave out loans without needing collateral.",
        "Right now, they needed 5-30 people to process a single report, based on company size, to generate insights to the management.",
        "This meant they needed massive manpower, and made decisions very slowly.",
        "Manager mentioned that it's an AI team problem, and they're looking to solve it once multimodal AI comes out.",
        "I said that the business needs a solution yesterday, and since they didn't have a project in mind anyways, let us tackle this.",
        "This was the pipeline. They contracting an external agency to conduct audits on every company that approached them for loans.",
        "They delivered a PDF report (non-parsable) to the company's S3 bucket. They refused to give API access.",
        "A team of consultants was then assigned to this report based on its size.",
        "They would decode this report, enter all details into Excel spreadsheets, use formulas to extract insights.",
        "After a month or two, they would generate another report with all this spreadsheet information to the management.",
        "I realized all these are tasks that can be quickly automated.",
        "It was a monumental undertaking, and a very long story, but we reduced the flow from 3 months to 4 minutes.",
        "The second a report arrived in the S3 bucket, within 4 minutes a final report would be ready for the management to review.",
        "We used S3 onAdd hook to run a Springboot microservice that was running on EC2.",
        "This microservice would forward the report to the Python Lambda function, which decomposed the report.",
        "The decomposed report would come back to the microservice, which fed it into AWS OpenSearch.",
        "Once, OpenSearch was populated, we built a LLM-based RAG and OpenSearch query portal in ReactJS where employees could quickly verify certain information.",
        "Earlier it used to take 5-6 minutes to find the right spreadsheet and verify information. Now just a few seconds and highly accurate.",
        "We prevented data corruption from the Tesseract OCR extraction, by running some business logic checks to ensure data integrity.",
        "Once, OpenSearch was populated the microservice would verify, and proceed to call another Lambda function, which would generate the final report.",
        "All of this in just 2 months. We went above and beyond because I felt if this was my business I would want it solved immediately.",
        "It was a massive success. I later found out from friends, that now they're making decisions within weeks and hundreds of roles were made redundant.",
        "However at the time, the internship was structured as a 6-month co-op.",
        "They told me that they're very impressed with my work, and would like me to join them full-time, so they offered PPO.",
        "I asked them for an exception to not continue my internship and focus on my degree, which they immediately granted.",
        "Contributed towards decreasing credit report processing time by 99%+ (from 3 months to 4 minutes) by building an automated document-processing pipeline using AWS Lambda, ECS, and Spring Boot microservices.",
        "Cut analyst data lookup time by 80% by engineering an indexing solution in Amazon OpenSearch, featuring faceted search and on-demand CSV export capabilities for multi-gigabyte datasets.",
        "Verified data against a rule set of 40+ business logic checks programmatically, by architecting a validation pipeline, eliminating previously common data corruption errors."
      ],
      "keywords": [
        "Java",
        "Spring Boot",
        "Python",
        "ReactJS",
        "AWS S3",
        "AWS Lambda",
        "AWS EC2",
        "AWS OpenSearch",
        "Tesseract OCR",
        "LLM",
        "RAG",
        "REST APIs",
        "System Architecture",
        "Event-Driven Architecture",
        "Microservices",
        "Process Automation",
        "Data Engineering (ETL)",
        "Cloud Architecture (AWS)",
        "Full-Stack Development",
        "NLP",
        "Data Integrity Management",
        "Workflow Optimization",
        "Initiative",
        "Proactive Problem-Solving",
        "Business Acumen",
        "Leadership",
        "Vision",
        "Persuasion",
        "Ownership Mentality",
        "Strategic Thinking",
        "Rapid Execution",
        "Stakeholder Management"
      ]
    }
  ],
  "projects": [
    {
      "project_name": "Jobbernaut",
      "description": "A full-stack application designed to streamline the job search process by tracking applications, providing analytics, and automatically tailoring resumes and cover letters using agentic AI.",
      "bullet_points": [
        "Designed Jobbernaut, which helps job seekers keep track of their job applications.",
        "It also automatically tailors their resumes and cover letters according to the Job Description, and public company knowledge.",
        "It also provides job seekers with a lot of insights into their job search, like referral rate, applications that worked within <24 hrs, etc.",
        "50+ people exhibited interest, and are actively used it.",
        "I am currently working on a production-ready version, as the original one was just a PoC which worked too well.",
        "Jobbernaut also automatically tailors the applicant's resume to the Job Description and the company, guaranteeing at least a 90% fit.",
        "Architected and developed an AI-driven automation engine to dynamically tailor application materials, using a Python-based agentic workflow, multiple LLM APIs, and a structured data approach (JSON/YAML).",
        "Initially integrated the engine as a core feature within the Jobbernaut application tracker. The feature demonstrated extremely high efficacy in user testing.",
        "Conducted a strategic product review and made the executive decision to pivot the feature into a private, proprietary build. This decision was based on its overwhelming effectiveness, which represented a core intellectual property asset too valuable for a free-to-public release.",
        "The private engine reduces application tailoring time by over 99.99% (from ~30 mins to 30 seconds) while measurably improving keyword alignment with job descriptions.",
        "This project demonstrates a full lifecycle of product development: from ideation and rapid prototyping with AI tools to strategic analysis and intellectual property management.",
        "The tool itself is enterprise-grade, with every line of code written with future maintenance in mind.",
        "The tool is also End-to-End rapid. From noticing a job to having a fully tailored resume (in PDF format too) and cover letter is about 30 seconds."
      ],
      "keywords": [
        "Python",
        "Agentic APIs",
        "Next.js",
        "TypeScript",
        "PostgreSQL",
        "System Design",
        "Database Architecture",
        "Project Planning",
        "Agile Methodologies",
        "Business Need Identification",
        "Marketing",
        "Continuous Iteration (Kaizen)"
      ],
      "project_url": "https://jobbernaut.srmanda.com/"
    },
    {
      "project_name": "MatchWise",
      "description": "An optimization tool featuring a Python backend and Flutter frontend to solve the NP-hard Resource-to-Task assignment problem using Integer Linear Programming, drastically reducing manual allocation time.",
      "bullet_points": [
        "Achieved a 90% reduction in manual allocation time by designing and backtesting an Integer Linear Programming (ILP) optimization model to solve the NP-hard Resource-to-Task assignment problem.",
        "Delivered sub-200ms API response times by engineering the model’s backend service using Python (FastAPI), enabling real-time interaction with the ILP solver from the Flutter frontend."
      ],
      "keywords": [
        "Python",
        "FastAPI",
        "PuLP",
        "OR-Tools",
        "Flutter",
        "Dart",
        "Firebase",
        "GitHub Actions",
        "CI/CD",
        "Algorithmic Thinking",
        "API Design",
        "Collaboration",
        "Initiative",
        "Communication",
        "Client Interaction"
      ],
      "project_url": "https://github.com/orgs/yashas-hm-unc/teams/523/repositories"
    },
    {
      "project_name": "Cervical Cancer Detection",
      "description": "A machine learning research project that developed a novel CNN-UMAP-SVM pipeline for medical image classification, significantly improving F1 score and reducing false negatives on public health datasets.",
      "bullet_points": [
        "Increased F1 score by 12% and drove false negatives below 2% by designing a novel CNN-UMAP-SVM pipeline for medical image classification on public health datasets."
      ],
      "keywords": [
        "Python",
        "Tensorflow",
        "Keras",
        "scikit-learn",
        "UMAP",
        "OpenCV",
        "Pandas",
        "NumPy",
        "Jupyter",
        "Kaggle",
        "Darknet",
        "Research",
        "Feature Extraction",
        "Machine Learning",
        "Computer Vision",
        "Sensitive Data Handling"
      ],
      "project_url": "https://www.kaggle.com/code/ashishreddy9000/fyp-track-2-darknet-feat-ext-svm-quadri"
    }
  ]
}
